import math

# ====================== ПАРАМЕТРЫ ======================
p = 4.802764507914655e-42 #то самое из модели
K = 6.0
N = 4.179e121

# ====================== ПРОВЕРКА ======================
left = K * p
right = N ** (-1 / 3)

rel_error = abs(left - right) / right * 100

print("=== ПРОВЕРКА ГИПОТЕЗЫ Kp = N^(-1/π) ===")
print(f"K               = {K}")
print(f"p               = {p:.4e}")
print(f"N               = {N:.6e}")
print(f"K * p           = {left:.12e}")
print(f"N^(-1/π)        = {right:.12e}")
print(f"Относительная ошибка = {rel_error:.8f} %")

if rel_error < 1e-5:
    print("\n✅ ГИПОТЕЗА ПОДТВЕРЖДЕНА С ВЫСОКОЙ ТОЧНОСТЬЮ!")
else:
    print("\n⚠️  Гипотеза не выполняется.")